---
type: StructuralSectionIParallelFlange
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 4
tags: [revit-api, class]
---

# StructuralSectionIParallelFlange

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionIParallelFlange | 2015 | `public StructuralSectionIParallelFlange ( double width , double height , double flangeThickness , double webThickness , double webFillet , double centroidHorizontal , double centroidVertical , double principalAxesAngle ,` |
| Property | BoltDiameter | 2015 | `public double BoltDiameter { get ; set ; }` |
| Property | BoltSpacing | 2015 | `public double BoltSpacing { get ; set ; }` |
| Property | ClearWebHeight | 2015 | `public double ClearWebHeight { get ; set ; }` |